Revit 2027 API
DockableFrameVisibilityChangedEventArgs.DockableFrameShown Property
 True if the pane is being shown, false if it is being hidden.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool DockableFrameShown { get; }
Public ReadOnly Property DockableFrameShown As Boolean
	Get
public:
property bool DockableFrameShown {
	bool get ();
}
member DockableFrameShown : bool with get
Property Value
Boolean
See Also
Reference
DockableFrameVisibilityChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace